<?php
/*
 * Copyright (c) 2020.
 *
 * Разработчик: Максим Епихин
 * Twitter: https://twitter.com/maximepihin
 */

/**
 * Файл конфигурации компонентов
 *
 * В данном конфигурационном файле прописывается карта компонентов, реализация которых требуется на все время исполнения
 * скрипта.
 * Формируется массив компонентов. Ключ массива может иметь любое название. Рекомендуется использовать осмысленные
 * значения, соответствующие названию класса. Значение ключа должно хранить в себе основной ключ <b>class</b>, который
 * принимает значение пространства имен класса. Ключ <b>params</b> задается в качестве массива для определения
 * одноименных свойств класса, где ключ - свойство, значение - типизированное значение.
 */
return [];